app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "common"], ["text", "lets do this"], ["created_at", "2020-11-23 04:02:34.810717"], ["updated_at", "2020-11-23 04:02:34.810717"], ["user_id", 1]]
---
    def create
        @article = Article.new(article_params)
        @article.user_id = current_user.id

        if @article.save