app/controllers/users_controller.rb

  def create
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("name", "letter", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "    nalin  aswani"], ["letter", "NA"], ["created_at", "2020-11-23 00:14:57.336022"], ["updated_at", "2020-11-23 00:14:57.336022"]]

  def update
      @user = User.find(params[:id])

      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "letter" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Not Me"], ["letter", "NM"], ["updated_at", "2020-11-23 00:21:18.637697"], ["id", 7]]